<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;

class ServiceTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Service::updateOrCreate([
            'slug_url' => 'himchistka',
            'seo_title' => 'Хімчистка салону авто від детейлінг студії у Івано-Франківську - CarStudio',
            'seo_desc' => 'детейлінг хімчистка салону',
            'name' => 'Хімчистка',
            'title' => 'Хімчистка салону',
            'desc' => "Хімчистка салону авто допоможе позбавитись від різноманітних забруднень у всіх важкодоступних місцях
Відновлення салону позбавить сидіння від дрібних подряпин, потертостей та поверне гарний вигляд;
Захист салону кварцовими складами захистить вас від пошкоджень у майбутньому та збереже доглянуту зовнішність надовго;
Поліровка дерев'яних/пластмасових вставок прибере зайві дефекти на ділянках декору;
Захист шкіряних торпед також врятує від майбутніх негативних факторів поверхню, надавши їй гарного зовнішнього вигляду.",
            'price' => 'від 3000грн',
            'prev' => 'prew.jpeg',
            'bg' => 'bg.jpeg',
            'media' => '1.png,2.png,3.png,4.png,5.png,6.png',
        ]);
        Service::updateOrCreate([
            'slug_url' => 'vmatini',
            'seo_title' => 'Професійне видалення вмятин без фарбування від детейлінг студії у Івано-Франківську - CarStudio',
            'seo_desc' => 'професійне видалення та ремонт вмятин без фарбування',
            'name' => "Вм'ятини",
            'title' => "Професійне видалення вмятин без фарбування",
            'desc' => "Вм’ятини на автомобілі виникають з наступних причин: авто потрапило у ДТП, не акуратна їзда, вандалізм, необачність водія . Дефект потрібно усунути як найшвидше. В області пошкодження з часом утворюються тріщіни, в які буде потрапляти волога.
Видалення вм’ятин на кузові автомобіля – трудомісткий процес, який потребує значних витрат часу і матеріалів, тому ціна залежить від наступних факторів. На автосервіс “CarStudio” працюють професіонали, які усунуть вм’ятини будь-якої складності. Місце з пошкодженням не відрізнятиметься від інших деталей автомобіля завдяки поверненню колишньої форми",
            'price' => 'договірна',
            'prev' => 'prew.jpg',
            'bg' => 'bg.jpg',
            'media' => '1.png,2.png,3.png,4.png,5.png,6.png,7.png,8.png,9.png,10.png,11.png,12.png',
        ]);
        Service::updateOrCreate([
            'slug_url' => 'poliruvanna',
            'seo_title' => 'Полірування авто від детейлінг студії у Івано-Франківську - CarStudio',
            'seo_desc' => 'детейлінг полірування, захисне покриття, кераміка, віск, детейлінг мийка',
            'name' => 'Полірування',
            'title' => 'Полірування авто',
            'desc' => "Основні фактори, які впливають на ЛКП:
Ультрафіолет: впливає на знебарвлення верхнього шару лакофарбового покриття.
Хімія: тверда вода, реагенти, агресивні миючі засоби – все це роз'їдає поверхневий шар ЛКП та веде до зниження блиску.
Механічні впливи: дорожній пил, дрібні камені, що летять в авто при їзді по трасі, гілки чагарника на узбіччі та недбала мийка відповідальні за появу подряпин та сколів.
Якщо всі ці проблеми торкнулися вас та вашого авто – ми Вам допоможемо! Автосервіс “CarStudio” пропонує якісне та недороге полірування кузова у м. Івано-Франківськ.",
            'price' => 'від 5000грн',
            'prev' => 'prew.jpeg',
            'bg' => 'bg.jpeg',
            'media' => '1.jpeg,2.jpeg,3.jpeg,4.jpeg,5.jpeg,6.jpeg,7.jpeg,8.jpeg,9.jpeg,10.jpeg,11.jpeg,12.jpeg,13.jpeg,14.jpeg,15.jpeg,16.jpeg',
        ]);
        Service::updateOrCreate([
            'slug_url' => 'pereshivka',
            'seo_title' => 'Пошиття, перетяжка, ремонт та фарбування шкіряних виробів в детейлінг студії у Івано-Франківську - CarStudio',
            'seo_desc' => 'тюнінг ательє, перешив та реставрація - салону, рулів, дверних карт, торпедо, стелі',
            'name' => 'Авто ательє',
            'title' => 'Авто ательє',
            'desc' => 'У салоні автомобіля все повинно відповідати вимогам власника, інакше він не зможе почуватися комфортно, не матиме необхідних йому речей і елементів, як функціональних, так і декоративних. CarStudio виправляють цю ситуацію, перетяжка салону автомобіля один із профільних напрямків, над яким працюють найпрофесійніші майстри.',
            'price' => 'договірна',
            'prev' => 'prew.jpeg',
            'bg' => 'bg.jpeg',
            'media' => '1.png,2.png,3.png',
        ]);
    }
}
