<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;

class ServiceTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
//        Service::updateOrCreate([
//            'slug_url' => 'broneplivka',
//            'seo_title' => 'seo_title',
//            'seo_desc' => 'seo_desc',
//            'name' => 'Бронеплівка',
//            'title' => 'Поклейка бронеплівки',
//            'desc' => 'desc',
//            'price' => '800-1000$',
//            'preview' => '11.png',
//            'media' => '11.png,12.png',
//        ]);
        Service::updateOrCreate([
            'slug_url' => 'poliruvanna',
            'seo_title' => 'Професійне полірування авто від детейлінг студія в Івано-Франківську - CarStudio',
            'seo_desc' => 'seo_desc',
            'name' => 'Полірування',
            'title' => 'Полірування авто',
            'desc' => "Полірування автомобіля – це необхідність

Полірування автомобіля - процедура, яка є не просто бажаною, а обов'язковою у багатьох ситуаціях. Давайте розберемося у всіх її тонкощах та різновидах. Це дозволить вам переконатися в актуальності полірування та визначити бажані терміни проведення.

Навіщо полірувати машину?

Полірування автомобіля - процес, який дозволяє:

• Загальмувати природне старіння лакофарбового покриття. Навіть найякісніші емалі та лаки з часом втрачають свої властивості, і оновити їх дозволяє полірування.
Усунути всі забруднення.

• Забезпечити захист покриття від дрібних подряпин та
тріщин. Скоротити негативний вплив хімічних речовин
агентів, якими обробляють дороги. редотвратить псування кузова авто внаслідок попадання на нього снігу, затримки рідини та
впливу інших чинників довкілля.

• Усунути наслідки автоматичних щіткових
мийок. Після такого очищення лакофарбове покриття може втрачати блиск.

Внаслідок полірування кузов авто:

• Набуває підвищених вологогрязевідштовхувальних властивостей.
тане більш стійким до ультрафіолету. набуває стійкості до корозії. Окислення металу припиняється.
Старіє повільніше.

• Виглядає більш привабливим. Кузов зберігає
яскравий колір та блиск на довгі роки, що підвищує вартість авто під час продажу.

• Має антикорозійні властивості що запобігає появи корозії.",
            'price' => '800-1000',
            'prev' => 'prew.jpeg',
            'bg' => 'bg.jpeg',
            'media' => '1.jpeg,2.jpeg,3.jpeg,4.jpeg,5.jpeg,6.jpeg,7.jpeg,8.jpeg,9.jpeg,10.jpeg',
        ]);
//        Service::updateOrCreate([
//            'slug_url' => 'himchistka',
//            'seo_title' => 'seo_title',
//            'seo_desc' => 'seo_desc',
//            'name' => 'Хімчистка',
//            'title' => 'Хімчистка салону',
//            'desc' => 'desc',
//            'price' => '800-1000$',
//            'preview' => '31.png',
//            'media' => '31.png',
//        ]);
        Service::updateOrCreate([
            'slug_url' => 'vmatini',
            'seo_title' => 'Професійне видалення вмятин без фарбування від детейлінг студія в Івано-Франківську - CarStudio',
            'seo_desc' => 'seo_desc',
            'name' => "Вм'ятини",
            'title' => "Професійне видалення вмятин без фарбування",
            'desc' => "Видалення вм'ятин без фарбування - це технологія усунення вм'ятин без пошкодження лакофарбового покриття. Ця технологія також називається PDR, абревіатура англійської назви цієї процедури - Paintless Dent Removal. За допомогою цієї технології усуваються сліди від граду, від зіткнення з падаючими предметами, паркувальні вм'ятини, а іноді - навіть аварійні.",
            'price' => 'договірна',
            'prev' => 'prew.jpg',
            'bg' => 'bg.jpg',
            'media' => '1.png,2.png,3.png,4.png,5.png,6.png,7.png,8.png,9.png',
        ]);
    }
}
